SELECT ROW_NUMBER() OVER() as НОМЕР,
        ФАМИЛИЯ, ИМЯ, ОТЧЕСТВО,
        AVG(CAST(ОЦЕНКА AS INT)) as Ср_оценка
FROM Н_ЛЮДИ
         INNER JOIN Н_УЧЕНИКИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
         INNER JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE Н_УЧЕНИКИ.ГРУППА = '4100'
  AND ОЦЕНКА IN ('5','4','3','2')
GROUP BY Н_ЛЮДИ.ИД, ФАМИЛИЯ, ИМЯ, ОТЧЕСТВО
HAVING AVG(CAST(ОЦЕНКА AS INT)) >=
       (SELECT MAX(CAST(ОЦЕНКА AS INT)) FROM Н_ЛЮДИ
        INNER JOIN Н_УЧЕНИКИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
        INNER JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
        WHERE Н_УЧЕНИКИ.ГРУППА = '3100'
        AND ОЦЕНКА IN ('5','4','3','2') );
