SELECT Н_ЛЮДИ.ФАМИЛИЯ, Н_ВЕДОМОСТИ.ЧЛВК_ИД FROM Н_ВЕДОМОСТИ
INNER JOIN Н_ЛЮДИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE Н_ЛЮДИ.ФАМИЛИЯ = 'Иванов'
  AND Н_ВЕДОМОСТИ.ИД = 1457443;
SELECT Н_ЛЮДИ.ОТЧЕСТВО, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_СЕССИЯ.ЧЛВК_ИД FROM Н_ЛЮДИ
RIGHT JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
RIGHT JOIN Н_СЕССИЯ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_СЕССИЯ.ЧЛВК_ИД
WHERE Н_ЛЮДИ.ФАМИЛИЯ < 'Иванов'
  AND Н_ВЕДОМОСТИ.ЧЛВК_ИД < 105590
  AND Н_СЕССИЯ.ДАТА = '2012-01-25';
SELECT COUNT(*) as UniqueNameCount FROM
    (SELECT ФАМИЛИЯ FROM Н_ЛЮДИ GROUP BY ФАМИЛИЯ) t;
SELECT ROW_NUMBER() OVER() as НОМЕР,
       ФАМИЛИЯ, ИМЯ, ОТЧЕСТВО,
       AVG(CAST(ОЦЕНКА AS INT)) as Ср_оценка
FROM Н_ЛЮДИ
         INNER JOIN Н_УЧЕНИКИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
         INNER JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE Н_УЧЕНИКИ.ГРУППА = '4100'
  AND ОЦЕНКА IN ('5','4','3','2')
GROUP BY Н_ЛЮДИ.ИД, ФАМИЛИЯ, ИМЯ, ОТЧЕСТВО
HAVING AVG(CAST(ОЦЕНКА AS INT)) >=
       (SELECT MAX(CAST(ОЦЕНКА AS INT)) FROM Н_ЛЮДИ
                                                 INNER JOIN Н_УЧЕНИКИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
                                                 INNER JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
        WHERE Н_УЧЕНИКИ.ГРУППА = '3100'
          AND ОЦЕНКА IN ('5','4','3','2') );
SELECT COUNT(*) as AveragePerformingStudents FROM
    (SELECT ОЦЕНКА FROM Н_ВЕДОМОСТИ WHERE Н_ВЕДОМОСТИ.ОЦЕНКА = '3') A;
